<template>
    <div class="separators">
        <div class="start">{{separator}}</div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                separator: ''
            };
        },
        mounted() {
            function getRandomInt(min, max) {
                min = Math.ceil(min);
                max = Math.floor(max);
                return Math.floor(Math.random() * (max - min)) + min;
            }

            let specs = [
                "┻━┻︵ \(°□°)/ ︵ ┻━┻",
                "__̴ı̴̴̡̡̡ ̡͌l̡̡̡ ̡͌l̡*̡̡ ̴̡ı̴̴̡ ̡̡͡|̲̲̲͡͡͡ ̲▫̲͡ ̲̲̲͡͡π̲̲͡͡ ̲̲͡▫̲̲͡͡ ̲|̡̡̡ ̡ ̴̡ı̴̡̡ ̡͌l̡̡̡̡.___",
                " •_•)O*¯`·.¸.·´¯`°Q(•_• ",
                "♫♪.ılılıll|̲̅̅●̲̅̅|̲̅̅=̲̅̅|̲̅̅●̲̅̅|llılılı.♫♪",
                "♪┏(°.°)┛┗(°.°)┓┗(°.°)┛┏(°.°)┓ ♪",
                " ¸.·´¯`·.´¯`·.¸¸.·´¯`·.¸><(((º>",
                "             .       ~~(__^·>",
                "óÔÔò ʕ·͡ᴥ·ʔ óÔÔò",
                "[♥]]] [♦]]] [♣]]] [♠]]]",
                "(>'-')> <('_'<) ^('_')\- \m/(-_-)\m/ <( '-')> \_( .\")> <( ._.)-`",
                "ѧѦ ѧ ︵͡︵ ̢ ̱ ̧̱ι̵̱̊ι̶̨̱ ̶̱ ︵ Ѧѧ ︵͡ ︵ ѧ Ѧ ̵̗̊o̵̖ ︵ ѦѦ ѧ",
                "／人 ◕‿‿◕ 人＼",
                "[{-_-}] ZZZzz zz z…",
                "{>==╦╦=ʖ><O>",
                "ƸӜƷ.•°*”˜˜”*°•.ƸӜƷ•°*”˜˜”*°•.ƸӜƷ",
                " |̲̲̲͡͡͡ ̲▫̲͡ ̲̲̲͡͡π̲̲͡͡ ̲̲͡▫̲̲͡͡ ̲|̡̡̡ ̡ ̴̡ı̴̡̡ ̡͌l̡ ̴̡ı̴̴̡ ̡l̡*̡̡ ̴̡ı̴̴̡ ̡̡͡|̲̲̲͡͡͡ ̲▫̲͡ ̲̲̲͡͡π̲̲͡͡ ̲̲͡▫̲̲͡͡ | ",
                "‛¯¯٭٭¯¯(▫▫)¯¯٭٭¯¯’",
                "^⨀ᴥ⨀^",
                "┬┴┬┴┤･ω･)ﾉ├┬┴┬┴",
                "ʕ•̫͡•ʕ*̫͡*ʕ•͓͡•ʔ-̫͡-ʕ•̫͡•ʔ*̫͡*ʔ-̫͡-ʔ",
                "│◦└̅┘◦ ◦ ﴾̭▒̭̊▒̭̊﴿ ﴾̭▓̭̊▓̭̊﴿ ﴾̭░̭̊░̭̊﴿ ◦ ◦ (͡ < ◦ ● ◦└̅┘◦│",
                ",,,)=(^.^)=(,,,",
                ">----(^_^)----<",
                "»-(¯`·.·´¯)->",
                ">'.')> <('.'<",
                "✲´*。.❄¨¯`*✲。❄。*。¨¯`*✲",
                "(˚Õ˚)ر ~~~~╚╩╩╝ "
            ];

            let r = getRandomInt(0, specs.length);
            this.separator = specs[r];
        }
    }
</script>